surfaceWater/runCases/RANS_2D/MeshSelection4/3mmx0.2mm/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1056
(
0.00118297
0.00118349
0.00118133
0.00118107
0.00116557
0.00116436
0.00113962
0.00113677
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    bottom
    {
        type            zeroGradient;
    }
    right
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
0.00122207
0.00122207
0.0012171
0.0012171
0.00120195
0.00120195
0.00117329
0.00117329
...
)
;
    }
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
    left
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
0.00122207
0.00122207
0.0012171
0.0012171
0.00120195
0.00120195
0.00117329
0.00117329
...
)
;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
